const dictionary = {
  Header: {
    title: 'ขอแสดงความยินดี!',
    subtitle: 'การประกวดโปรโมชั่นบน',
  },
  Main: {
    dearUser: 'เรียนผู้ใช้',
    today: 'วันนี้',
    prize: 'ซัมซุงกาแล็กซี่ A53',
    p1: 'คุณได้รับการสุ่มเลือกให้เข้าร่วมในแบบสํารวจนี้ มันจะใช้เวลาเพียงหนึ่งนาทีและคุณอาจได้รับรางวัล: a',
    p2: 'ทุกเดือนเราสุ่มเลือกผู้ใช้ 10 คนเพื่อลุ้นรับรางวัลที่ยอดเยี่ยม รางวัลปัจจุบันคือ',
    p3: 'ผู้โชคดีเพียง 10 คนและเฉพาะเมื่อคุณอาศัยอยู่ในประเทศของคุณ',
  },
  Counter: {
    p1: 'คุณมีเท่านั้น',
    p2: 'เพื่อเข้าร่วม',
    minutes: 'รายงานการประชุม',
    seconds: 'วินาที',
    and: 'และ',
  },
  SurveyTexts: [
    {
      q: 'เพศของคุณคืออะไร?',
      a: ['ผู้หญิง', 'ผู้ชาย'],
    },
    {
      q: 'คุณอายุเท่าไร ',
      a: ['อายุต่ํากว่า 18 ปี', '18-29 ปี', '30-49 ปี', '50-80 ปี'],
    },
    {
      q: 'มีกี่คนที่อาศัยอยู่กับคุณในบ้าน?',
      a: ['หนึ่ง', 'สอง', 'สาม', 'สี่'],
    },
    {
      q: 'คุณเคยใช้อุปกรณ์นี้หรือไม่?',
      a: ['ใช่', 'ไม่ใช่'],
    },
  ],
  CommentsSection: {
    commentsWord: 'ความ คิด เห็น',
    sort: 'เรียงตาม: ด้านบน',
    likes: 'ชอบ',
    reply: 'ตอบ',
    Comments: [
      {
        name: 'Maria Farela',
        text: 'เป็นไปได้ไหมที่จะเล่นอีกครั้ง? :)',
        relativeTime: 'เพิ่ง',
      },
      {
        name: 'Fred Hedbeek',
        text: 'ฉันเคยได้ยินเกี่ยวกับเรื่องนี้!',
        relativeTime: '1 ชั่วโมง 17 นาที ที่แล้ว',
      },
      {
        name: 'Patricia Kincey',
        text: 'ขอบคุณมาก!',
        relativeTime: '1 ชั่วโมง 23 นาที ที่แล้ว',
      },
      {
        name: 'Miguel Sanchez',
        text: 'ของขวัญทั้งหมดว่างเปล่า!!',
        relativeTime: '1 ชั่วโมง 30 นาที ที่แล้ว',
      },
      {
        name: 'Mitchell Snyder',
        text: 'ใช่!',
        relativeTime: '1 ชั่วโมง 39 นาที ที่แล้ว',
      },
      {
        name: 'Judy Robin',
        text: 'คุณต้องทําตามคําแนะนําทั้งหมดอย่างระมัดระวัง',
        relativeTime: '1 ชั่วโมง 47 นาที ที่แล้ว',
      },
      {
        name: 'Matthew Helme',
        text: 'ฉันไม่เคยชนะอะไรมาก่อน',
        relativeTime: '1 ชั่วโมง 59 นาที ที่แล้ว',
      },
      {
        name: 'Davidson Bazil',
        text: 'ฉันสูญเสีย:(',
        relativeTime: '1 ชั่วโมงที่แล้ว',
      },
      {
        name: 'Scott Michalczyk',
        text: 'ฉันเคยเห็นเกมนี้เมื่อปีที่แล้ว แต่ฉันเพิกเฉยเพราะฉันคิดว่ามันไร้สาระ ฉันจะลองอีกครั้ง!',
        relativeTime: '1 ชั่วโมงที่แล้ว',
      },
      {
        name: 'Layelle Johnson',
        text: 'ขอบคุณมากมันน่าทึ่งมาก!! นี่คือสิ่งที่ดีที่สุด!!',
        relativeTime: '1 ชั่วโมงที่แล้ว',
      },
      {
        name: 'Christopher Gibbs',
        text: 'มีอะไรอยู่ในหน้าถัดไป?',
        relativeTime: '1 ชั่วโมงที่แล้ว',
      },
      {
        name: 'Pamela Hills',
        text: 'โอ้ฉันเป็นคนเดียวที่แพ้? :( :(',
        relativeTime: '1 ชั่วโมงที่แล้ว',
      },
      {
        name: 'Paul Wesley',
        text: 'จริงหรือไม่?',
        relativeTime: 'เมื่อวานนี้ เวลา 2:00 น.',
      },
      {
        name: 'Mandy Brooke',
        text: 'คุณเหลือเชื่อมาก! ขอบคุณสําหรับการทําเช่นนี้!',
        relativeTime: 'เมื่อวานนี้ เวลา 2:00 น.',
      },
      {
        name: 'George Brown',
        text: 'ขอบคุณ! ขอบคุณ!',
        relativeTime: 'เมื่อวานนี้ เวลา 2:00 น.',
      },
      {
        name: 'Angelo Rodriguez',
        text: 'นี่เป็นเรื่องตลกหรือไม่?',
        relativeTime: 'เมื่อวานนี้ เวลา 1:30 น.',
      },
    ],
  },
  Modal: {
    Welcome: {
      title: 'ขอแสดงความยินดีคําตอบของคุณถูกต้อง',
      description: 'ตอนนี้คุณมีโอกาสได้รับของขวัญ',
      description2: 'ทดสอบโชคของคุณ',
      onCloseText: 'ต่อเนื่อง',
    },
    FirstTry: {
      title: 'เคราะห์ร้าย! ลองอีกครั้ง',
      description: 'เหลือความพยายาม 2 ครั้ง',
    },
    SecondTry: {
      title: 'คุณกําลังเข้าร่วมการแข่งขัน',
      description: 'ดําเนินการในขั้นตอนถัดไป',
    },
  },
  Assessment: {
    heading: 'กําลังตรวจสอบคําตอบของคุณ...',
    p1: 'ตอบคําถาม 4 / 4 ข้อ',
    p2: 'ไม่พบแบบสํารวจก่อนหน้านี้จาก IP ของคุณ',
    p3: 'ยังมีของขวัญให้!',
  },
};

export default dictionary;
